---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
source: html/4f8088da-5734-6d40-f746-9fac055e21ee.htm
---
# RebarShapeConstraintProjectedSegmentLength Properties

A vector specifying the direction of the constraint. The direction is fixed,
 and the shape is always constructed so that the segment
 direction has a positive dot product with this vector.